IDEA Open Model
LoadInPoint Properties
Compatible with IDEA StatiCa Beta 20.0
The LoadInPoint type exposes the following members.
Properties
Name | Description
Direction
 Local / global
Fx
 Force in X direction
Fy
 Force in Y direction
Fz
 Force in Z direction
Geometry
 Gets, sets geometry
Id
 Element Id
 (Inherited from OpenElementId.)
Mx
 Moment about the x-axis
My
 Moment about the y-axis
Mz
 Moment about the z-axis
Top
See Also
Reference
LoadInPoint Class
IdeaRS.OpenModel.Loading Namespace